写入导入 pandas 的语句， 并且给 pandas 别名为 `pd`。

In [1]:
import pandas as pd

创建一个叫 `Name` 的 Series， 里面包含字符串元素 `"孙哥", "黄哥", "翘兔", "sed老师", "狗处", "死矮子"` ， 标签为 `"001", "002", "003", "004", "005", "006"` 。

创建一个叫 `Gender` 的 Series， 里面包含字符串元素 `"女", "女", "男", "男", "女", "男"` ， 标签为 `"006", "005", "004", "003", "002", "001"` 。

创建一个叫 `Height` 的 Series， 里面包含字符串元素 `172.5, 168.0, 178.2, 181.3, 161.7` ， 标签为 `"001", "002", "003", "004", "005"` 。

In [2]:
Name = pd.Series(["孙哥", "黄哥", "翘兔", "sed老师", "狗处", "死矮子"],
                index = ["001", "002", "003", "004", "005", "006"])
Gender = pd.Series(["女", "女", "男", "男", "女", "男"],
                index = ["006", "005", "004", "003", "002", "001"])
Height = pd.Series([172.5, 168.0, 178.2, 181.3, 161.7],
                index = ["001", "002", "003", "004", "005"])

创建一个名叫`Students`的`DataFrame`, 包含列名姓名、性别、身高，数据分别对应创建好的`Name`、`Gender`、以及`Height`这三个Series，输出创建好的`Students`。

In [3]:
Students = pd.DataFrame({"姓名": Name, "性别": Gender, "身高": Height})
Students

        姓名 性别     身高
001     孙哥  男  172.5
002     黄哥  女  168.0
003     翘兔  男  178.2
004  sed老师  男  181.3
005     狗处  女  161.7
006    死矮子  女    NaN

打印`Students`所有索引和列名。

In [4]:
print(Students.index)
print(Students.columns)

Index(['001', '002', '003', '004', '005', '006'], dtype='object')
Index(['姓名', '性别', '身高'], dtype='object')

输出`Students`的行和列进行转置后的结果。

In [5]:
Students.T

      001    002    003    004    005  006
姓名     孙哥     黄哥     翘兔  sed老师     狗处  死矮子
性别      男      女      男      男      女    女
身高  172.5  168.0  178.2  181.3  161.7  NaN

输出`Students`的身高列。

In [6]:
Students.身高

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

In [7]:
Students["身高"]

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

输出`Students`的性别和身高列。

In [8]:
Students[["性别", "身高"]]

    性别     身高
001  男  172.5
002  女  168.0
003  男  178.2
004  男  181.3
005  女  161.7
006  女    NaN

输出`Students`索引为 003 的行。

In [9]:
Students.loc["003"]

姓名       翘兔
性别        男
身高    178.2
Name: 003, dtype: object

输出 `Students`索引为 003、004、005 的行。

In [10]:
Students.loc["003": "005"]

        姓名 性别     身高
003     翘兔  男  178.2
004  sed老师  男  181.3
005     狗处  女  161.7

输出`Students`里索引为 005 的身高。

In [11]:
Students.loc["005", "身高"]

np.float64(161.7)

输出`Students`索引为003、005的数据的姓名和身高。

In [12]:
Students.loc[["003", "005"],["姓名", "身高"]]

     姓名     身高
003  翘兔  178.2
005  狗处  161.7

输出`Students`索引为003、005的数据的所有变量。

In [14]:
Students.loc[["003", "005"],:]

     姓名 性别     身高
003  翘兔  男  178.2
005  狗处  女  161.7

输出`Students`里身高大于165的女性。

In [16]:
Students["身高"] > 165

001     True
002     True
003     True
004     True
005    False
006    False
Name: 身高, dtype: bool

In [17]:
Students

        姓名 性别     身高
001     孙哥  男  172.5
002     黄哥  女  168.0
003     翘兔  男  178.2
004  sed老师  男  181.3
005     狗处  女  161.7
006    死矮子  女    NaN

In [18]:
Students[Students["身高"] > 165]

        姓名 性别     身高
001     孙哥  男  172.5
002     黄哥  女  168.0
003     翘兔  男  178.2
004  sed老师  男  181.3

In [19]:
Students["性别"] == "女"

001    False
002     True
003    False
004    False
005     True
006     True
Name: 性别, dtype: bool

In [20]:
Students[Students["性别"] == "女"]

      姓名 性别     身高
002   黄哥  女  168.0
005   狗处  女  161.7
006  死矮子  女    NaN

In [22]:
Students[(Students["身高"] > 165) & (Students["性别"] == "女")]

     姓名 性别     身高
002  黄哥  女  168.0

通过`head`方法，输出`Students`前五行数据。

In [24]:
Students.head(5)

        姓名 性别     身高
001     孙哥  男  172.5
002     黄哥  女  168.0
003     翘兔  男  178.2
004  sed老师  男  181.3
005     狗处  女  161.7

In [25]:
Students.head()

        姓名 性别     身高
001     孙哥  男  172.5
002     黄哥  女  168.0
003     翘兔  男  178.2
004  sed老师  男  181.3
005     狗处  女  161.7